package com.walking.lesson17_enum.task1;

import java.util.Scanner;

import static com.walking.lesson17_enum.task1.Phrase.*;

/**
 * Написать программу, которая принимает строку с клавиатуры.
 * Если строка == "Hi" - вывести в консоль "Hello",
 * если Bye - Good bye,
 * если How are you - How are your doing.
 * Если любая другая строка - вывести Unknown message.
 * Сделать через switch-caseHI
 */
public class Main {
    public static void main(String[] args) {
//        Создаем сканер для чтения с клавиатуры
        Scanner scanner = new Scanner(System.in);

//        Выводим сообщение "Enter string: " в консоль.
//        Данное сообщение не является обязательным, лишь информирует пользователя,
//        какое действие от него ожидается
        System.out.print("Enter string: ");
//        Объявляем переменную s типа String и записываем в нее значение, введенное с клавиатуры
        String s = scanner.nextLine();

//        Сканер более не используется, ее необходимо закрыть.
//        Зачем - разберемся, когда будем изучать I/O Streams
        scanner.close();
        boolean isExist = false;

        for(Phrase currentPhrase : Phrase.values()) {
            if (currentPhrase.getName().equals(s)) {
                System.out.println(currentPhrase.geFulltPhrase());
                isExist = true;
            }
        }
        if (!isExist)
            System.out.println("Unknown message");
    }
}